In [1]:
from cassandra.cluster import Cluster

In [2]:
cluster = Cluster(['cassandra_udacity'], port=9042)

In [3]:
session = cluster.connect()

In [4]:
session.execute("""
    CREATE KEYSPACE IF NOT EXISTS udacity_cassandra
    WITH REPLICATION = 
        {'class':'SimpleStrategy', 'replication_factor':1}

""")

In [5]:
session.set_keyspace('udacity_cassandra')

In [6]:
query = '''select * from full_data WHERE artist='None';'''

In [7]:
import pandas as pd
df = pd.DataFrame(list(session.execute(query)))

In [8]:
df

,artist,sessionid,song,userid,firstname,gender,iteminsession,lastname,length,level,location
0,None,10,None,11.0,Christian,F,2,Porter,None,free,"Elkhart-Goshen, IN"
1,None,1001,None,61.0,Samuel,M,0,Gonzalez,None,free,"Houston-The Woodlands-Sugar Land, TX"
2,None,1002,None,32.0,Lily,F,0,Burns,None,free,"New York-Newark-Jersey City, NY-NJ-PA"
3,None,1003,None,44.0,Aleena,F,3,Kirby,None,paid,"Waterloo-Cedar Falls, IA"
4,None,1004,None,80.0,Tegan,F,17,Levine,None,paid,"Portland-South Portland, ME"
...,...,...,...,...,...,...,...,...,...,...,...
680,None,996,None,55.0,Martin,M,0,Johnson,None,free,"Minneapolis-St. Paul-Bloomington, MN-WI"
681,None,997,None,None,None,None,1,None,None,paid,None
682,None,998,None,36.0,Matthew,M,20,Jones,None,paid,"Janesville-Beloit, WI"
683,None,999,None,88.0,Mohammad,M,9,Rodriguez,None,paid,"Sacramento--Roseville--Arden-Arcade, CA"
684,None,999,None,None,None,None,12,None,None,paid,None

In [9]:
#First query needed

In [14]:
sql_1 = "SELECT artist, song, length from data_1 where sessionID='338' and itemInSession='4';"

In [15]:
df = pd.DataFrame(list(session.execute(sql_1)))

In [16]:
df

      artist                             song    length
0  Faithless  Music Matters (Mark Knight Dub)  495.3073

In [17]:
#Second query

In [20]:
sql_2 = "SELECT artist, song, firstName, lastName from data_2 where userId='10' and sessionId='182';"

In [21]:
df = pd.DataFrame(list(session.execute(sql_2)))

In [22]:
df

,artist,song,firstname,lastname
0,Lonnie Gordon,Catch You Baby (Steve Pitron & Max Sanna Radio...,Sylvie,Cruz
1,Sebastien Tellier,Kilometer,Sylvie,Cruz
2,Three Drives,Greece 2000,Sylvie,Cruz
3,Down To The Bone,Keep On Keepin' On,Sylvie,Cruz

In [23]:
#Third query

In [24]:
sql_3 = "SELECT firstName, lastName from data_3 where song='All Hands Against His Own';"

In [25]:
df = pd.DataFrame(list(session.execute(sql_3)))

In [26]:
df

  firstname lastname
0     Tegan   Levine